num = 0

while num <= 40:
    print(f'{3 + num}')
    num += 10


# avto = input("Введите данные об автомобиле в формате: МАРКА [пробел] Год выпуска [пробел] Пробег [пробел] Цена"'\n')



print('-' * 50) # --------------------------------------------------


password = input('Введите пароль. Длина пароля должна быть не менее 8 знаков:''\n')

while len(password) < 8:
    password = input('Введите пароль длиной не менее 8 знаков: ''\n')
else:
    print('Пароль принят!')


print('-' * 50) # --------------------------------------------------



avto = input('Введите параметры автомобиля по шаблону''\n''LADA 2010г 205000км 450000руб ').split()


print(f'Продается автомобиль\nМарка: {avto[0]}\nГод выпуска: {avto[1]}\nПробег: {avto[2]}\nЦена: {avto[3]}')

# LADA 2010г 205000км 450000руб
# KIA 2017г 150000км 1100000руб

x = 10
y = 25
print(f"{x = }, {y = }")

print('-' * 50) # --------------------------------------------------

# a = []
#
# for i in range(100):
#     a.append(input())
#
# print(a)

a = ['book009 8 7', 'book027 7 79', 'book094 7 37', 'book062 7 23', 'book034 7 21', 'book093 7 21', 'book076 7 15', 'book081 7 13', 'book074 7 11', 'book059 7 5', 'book033 6 99', 'book085 6 97', 'book040 6 95', 'book052 6 95', 'book066 6 93', 'book023 6 91', 'book025 6 91', 'book053 6 91', 'book082 6 89', 'book003 6 87', 'book026 6 87', 'book039 6 87', 'book058 6 83', 'book037 6 79', 'book067 6 79', 'book051 6 73', 'book002 6 71', 'book061 6 69', 'book048 6 67', 'book006 6 61', 'book088 6 61', 'book036 6 57', 'book001 6 53', 'book077 6 53', 'book031 6 47', 'book060 6 43', 'book073 6 41', 'book030 6 39', 'book080 6 35', 'book078 6 29', 'book099 6 25', 'book041 6 23', 'book091 6 21', 'book071 6 17', 'book049 6 15', 'book000 6 11', 'book044 6 11', 'book092 5 99', 'book011 5 97', 'book079 5 97', 'book096 5 95', 'book010 5 93', 'book056 5 93', 'book008 5 85', 'book087 5 83', 'book084 5 79', 'book090 5 75', 'book043 5 73', 'book070 5 71', 'book089 5 71', 'book042 5 67', 'book046 5 67', 'book072 5 67', 'book047 5 65', 'book021 5 63', 'book004 5 57', 'book017 5 57', 'book063 5 57', 'book019 5 47', 'book020 5 47', 'book015 5 45', 'book022 5 45', 'book028 5 45', 'book050 5 45', 'book018 5 41', 'book032 5 41', 'book083 5 41', 'book024 5 39', 'book029 5 39', 'book007 5 37', 'book012 5 35', 'book065 5 35', 'book095 5 33', 'book086 5 27', 'book014 5 25', 'book057 5 25', 'book016 5 23', 'book068 5 21', 'book097 5 17', 'book035 5 11', 'book005 5 9', 'book013 5 9', 'book055 4 75', 'book054 4 65', 'book069 4 45', 'book045 4 21', 'book098 4 21', 'book064 4 7', 'book038 4 3', 'book075 3 7']

b = ['book009 8 7', 'book027 7 79', 'book094 7 37', 'book062 7 23', 'book034 7 21', 'book093 7 21', 'book076 7 15', 'book081 7 13', 'book074 7 11', 'book059 7 5', 'book033 6 99', 'book085 6 97', 'book040 6 95', 'book052 6 95', 'book066 6 93', 'book023 6 91', 'book025 6 91', 'book053 6 91', 'book082 6 89', 'book003 6 87', 'book026 6 87', 'book039 6 87', 'book058 6 83', 'book037 6 79', 'book067 6 79', 'book051 6 73', 'book002 6 71', 'book061 6 69', 'book048 6 67', 'book006 6 61', 'book088 6 61', 'book036 6 57', 'book001 6 53', 'book077 6 53', 'book031 6 47', 'book060 6 43', 'book073 6 41', 'book030 6 39', 'book080 6 35', 'book078 6 29', 'book099 6 25', 'book041 6 23', 'book091 6 21', 'book071 6 17', 'book049 6 15', 'book000 6 11', 'book044 6 11', 'book092 5 99', 'book011 5 97', 'book079 5 97', 'book096 5 95', 'book010 5 93', 'book056 5 93', 'book008 5 85', 'book087 5 83', 'book084 5 79', 'book090 5 75', 'book043 5 73', 'book070 5 71', 'book089 5 71', 'book042 5 67', 'book046 5 67', 'book072 5 67', 'book047 5 65', 'book021 5 63', 'book004 5 57', 'book017 5 57', 'book063 5 57', 'book019 5 47', 'book020 5 47', 'book015 5 45', 'book022 5 45', 'book028 5 45', 'book050 5 45', 'book018 5 41', 'book032 5 41', 'book083 5 41', 'book024 5 39', 'book029 5 39', 'book007 5 37', 'book012 5 35', 'book065 5 35', 'book095 5 33', 'book086 5 27', 'book014 5 25', 'book057 5 25', 'book016 5 23', 'book068 5 21', 'book097 5 17', 'book035 5 11', 'book005 5 9', 'book013 5 9', 'book055 4 75', 'book054 4 65', 'book069 4 45', 'book045 4 21', 'book098 4 21', 'book064 4 7', 'book038 4 3', 'book075 3 7']

print(a == b)
