n = 10
m = 100

print('1 -', n, '2 -', m, 'm/n =', m//n)

# st = set{1, 2, 3, [1, 2, 3], 5, {'a': 1, 'b': 2}}


"""
множество - неупорядоченная коллекция уникальных неизменяемых объектов
"""


st = set()

a = 1, 2, 3
b = [1, 2, 3]
c = 'w'
d = {'a': 1, 'b': 2}
e = 4, 5, 6

st.add(a)
st.add(c)
st.update(e)

print(st)
print(type(st))

# объединение
st1 = {3, 4, 33}
st2 = {3, 4, 44}
res = st1.union(st2)    # получаем все элементы     - альтернативно (|)
print(res)

# пересечение
st1 = {3, 4, 33}
st2 = {3, 4, 44}
res = st1.intersection(st2)    #  нахождение общих элементов, остальное отбрасывается - альтернативно (&)
print(res)

# вычитание
st1 = {3, 4, 33}
st2 = {3, 4, 44}
res = st1.difference(st2)    #  из первого мн-ва удаляются все элементы находящиеся во втором мн-ве - альтернативно (-)
print(res)

# вычитание
st1 = {3, 4, 33}
st2 = {3, 4, 44}
res = st2 - st1    #  из первого мн-ва удаляются все элементы находящиеся во втором мн-ве - альтернативно (-)
print(res)

# симметричное вычитание
st1 = {3, 4, 33}
st2 = {3, 4, 44}
res = st1.symmetric_difference(st2)    # объединение в множество различий 2-х множеств - альтернативно (^)
res = st1 ^ st2
print(res)  # {33, 44}


st3 = {3, 4}
print(st3.issubset(st2))
print(st1.issuperset(st3))

