import datetime

d = datetime.datetime.now()
print(d)                    # 2026-09-22 22:12:47.269335

d = datetime.date.today()
print(d)                    # 2026-09-22

date = d.strftime('%d-%m-%Y')       # форматирование
print(date)                    # 22-09-2026

date = d.strftime('%d %B %Y')       # форматирование
print(date)                    # 22 September 2026

date = d.strftime('%d %b %Y')       # форматирование
print(date)                    # 22 Sep 2026

date = d.strftime('%c')
print(date)                     # Tue Sep 22 00:00:00 2026


"""
%y      21      Год, краткая версия, без века (2021)
%Y      2021    Год, полная версия
%d      31      День месяца 01-31
%b      Dec     Название месяца, краткая версия, обычно три символа в длину
%B      December    Название месяца, полная версия
%m      12          Месяц в виде числа 01-12, январь - 01
%a      Wed         Будний день, краткая версия, обычно длиной в три символа
%A      Wednesday   Будний день, полная версия
%w      3           Будний день в виде числа 0-6, 0 - воскресенье
%H      17          Час 00-23 (24-часовой формат)
%M      35          Минута 00-59
%S      14          Секунда 00-59
%c      Tue Dec 10   17:41:00 2019          Местная версия даты и времени
%x      12.10.2019                          Местная версия даты (мм/dd/yy)
%X      17:41:00                            Местная версия времени (чч:мм:сс)
"""
m = d.month
print(m)








