from tkinter import *

def change():
    """
    Меняет текст на метке и ее параметры
    """
    metka['text'] = 'Черная метка'
    metka['bg'] = 'black'

window = Tk()       # создаем окно приложения

metka = Label(text='Привет всем!', bg="DarkRed", fg='LightSalmon',
              width=15, height=5)       # создание метки в окне, цвета ее фона (bg), цвета шрифта (fg),
                                        # размер метки в символах

                                        # метка меняет размер под текст если не задать специально
metka.pack()                        # размещение метки в окне

knopka = Button(text='Изменить метку', width=15, height=3)  # создание кнопки и ее размеров, если размеры не указаны, то подгоняется под текст
knopka.config(command=change)                           # конфигурация кнопки, чтобы она выполняла какое-либо действие
knopka.pack()

window.mainloop()   # главный цикл, чтобы главное окно постоянно обновлялось